{
  "about.tagline": "create patterns for robots that draw in sand with ball bearings",
  "description.chladni": "Chladni figures are nodal line patterns from vibrating plates. Sand collects along lines where amplitude is zero.",
  "description.circlePacker": "Circle packing is an arrangement of circles of different sizes such that no overlapping occurs and no circle can be enlarged without creating an overlap.",
  "description.epicycloid": "A clover shape is an epicycloid. Imagine two circles, with the outer circle rolling around the inside one. The shape traced by a point on the outer circle as it rolls is called an epicycloid.",
  "description.fractalSpirograph": "A fractal spirograph is generated by a series of circles that rotate around one another. The pattern is created by tracing a point that rides along the outermost circle as it rolls.",
  "description.heart": "A heart curve can be defined in a number of ways mathematically. Ours is a parametric equation.",
  "description.hypocycloid": "A web shape is a hypocycloid. Imagine two circles, with the inner one rolling around inside the outer one. The shape traced by a point on the inner circle as it rolls is called a hypocycloid.",
  "description.lsystem": "A fractal line writer is a Lindenmayer (L) system. L-systems string together symbols to specify instructions for moving in 2D space (e.g., turn left or right, move left or right). When applied recursively, they generate fractal patterns.",
  "description.noise_wave": "Perlin noise is a type of gradient noise that can be used to generate textures and terrain. Here we use it to create a pleasing series of wavy lines.",
  "description.programCode": "When exporting the pattern to a file, the provided program code is added before and/or after this layer is rendered.",
  "description.reuleaux": "A Reuleaux polygon is a curve of constant width made up of circular arcs of constant radius. It is named after the 19th-century German engineer Frances Reuleaux, who used the Reuleaux triangle in his designs.",
  "description.rose": "A rose is a curve that has a petal-like shape.",
  "description.spaceFiller": "A space filling curve draws a continuous line that covers every point in a space without missing any location or crossing itself.",
  "description.tessellationTwist": "A tessellation twist shape is a form of tessellation. Tessellation covers a surface with tiles (in our case, equilateral triangles) with no overlaps or gaps.",
  "description.v1Engineering": "This shape represents the V1 Engineering logo. V1 Engineering provides low-cost, customizable machine designs. Sandify was created in 2017 by users of their forum.",
  "description.voronoi": "A Voronoi diagram divides a space into regions based on a set of seed points. Each region contains all the points that are closer to its seed point than to any other seed point.",
  "export.wikiNote": "See the <0>wiki</0> for details on program export variables.",
  "layer.seeMoreInfo": "See <0>{{linkText}}</0> for more information.",
  "linkText.chladni": "Wikipedia",
  "linkText.circlePacker": "Wikipedia",
  "linkText.epicycloid": "Wolfram Mathworld",
  "linkText.fractalSpirograph": "this blog post",
  "linkText.heart": "Wolfram Mathworld",
  "linkText.hypocycloid": "Wolfram Mathworld",
  "linkText.lsystem": "Wikipedia",
  "linkText.noise_wave": "Wikipedia",
  "linkText.reuleaux": "Wikipedia",
  "linkText.rose": "Wolfram Mathworld",
  "linkText.spaceFiller": "Wikipedia",
  "linkText.tessellationTwist": "Wikipedia",
  "linkText.v1Engineering": "V1 Engineering",
  "linkText.voronoi": "Wikipedia"
}
